# frozen_string_literal: true

def attach_photo(product)
  file_name = product.id.to_s.chars.last
  file_name = '10' if file_name == '0'
  product.photo.attach(io: File.open("app/assets/images/#{file_name}.jpg"), filename: "#{file_name}.jpg")
  product.save
end

array_title = [ 'Evening dress', 'Casual dress', 'Strict dress','Warm dress', 'Summer dress' ]

array_title.each do |title_name|
  Category.create(title: "#{title_name}") unless Category.where(title: "#{title_name}").present?
end

a = Product.create(name: 'Веселка',
               description: 'Правильно обрана сукня жіноча підіймає настрій на цілий день!
    Модель зшита з крепу має квітковий принт. Сукня має круглий виріз горловини, довгі рукави та довжину міді.Силует напівприталений, злегка розширений. Талію підкреслює знімний пасок. Ви завжди можете купити сукню через інтернет у нас на сайті з доставленням по Україні.',
               price: 1200,
               category_id: Category.find_by(title: 'Evening dress').id)

attach_photo(a)

b = Product.create(name: 'Ко-ко',
               description: 'Елегантна сукня глибокого сірого кольору – чудове рішення для робочих буднів! В міру щільна та фактурна тканина вигідно виглядає з мінімум деталями. Сукня вище колін, з довгими вшивними рукавами. Шию та зону декольте гарно обрамлює V-подібний виріз горловини. Силует прямий, у бокових швах заховані невеликі кишені. Ця сукня жіноча завжди виручить у прохолодні дні!',
               price: 1400,
               category_id: Category.find_by(title: 'Warm dress').id)

attach_photo(b)

c = Product.create(name: 'Агата',
               description: 'Придивіться до цієї жіночої трикотажної сукні та уявіть її у своєму гардеробі. Впевнені майже на 100%, що у вас є речі та аксесуари, які до неї пасуватимуть. Річ в тім, що саме такий крій стильної сукні до коліна для жінок є найуніверсальнішим – вона може бути константою образу або його вагомою частиною: зі шкірянкою та кросівками, із черевичками на підборах і кардиганом, із масивними чи елегантними чоботами тощо.',
               price: 1000,
               category_id: Category.find_by(title: 'Strict dress').id)

attach_photo(c)

d = Product.create(name: 'Роза',
               description: 'Полюбляючи зручні речі й не надаючи перевагу естетиці без комфорту, сучасні жінки радо наповнюють гардероб саме такими сукнями, як ця! Неймовірно жіночна, зі зручною довжиною до коліна та з елегантною горловиною-човником, яка трішки відкриває ключиці, вона не сковує рухів і в одну мить стає стильною частиною повсякденного образу. Бежевий колір з тендітним принтом прикрашений вставками з екошкіри по плечах. Довгий спущений рукав і пояс, який за потреби можна одягати, а можна й залишити вдома.',
               price: 1500,
               category_id: Category.find_by(title: 'Casual dress').id)

attach_photo(d)

e = Product.create(name: 'Краса',
               description: 'Полюбляючи зручні речі й не надаючи перевагу естетиці без комфорту, сучасні жінки радо наповнюють гардероб саме такими сукнями, як ця! Неймовірно жіночна, зі зручною довжиною до коліна та з елегантною горловиною-човником, яка трішки відкриває ключиці, вона не сковує рухів і в одну мить стає стильною частиною повсякденного образу. Бежевий колір з тендітним принтом прикрашений вставками з екошкіри по плечах. Довгий спущений рукав і пояс, який за потреби можна одягати, а можна й залишити вдома.',
               price: 1500,
               category_id: Category.find_by(title: 'Casual dress').id)

attach_photo(e)

f = Product.create(name: 'Отава',
               description: 'Мода – циклічна, і ця стильна сукня з інтернет-магазину якнайкраще демонструє торжество крою з 80-х! Модель, представлена на сайті жіночого одягу, пошита з костюмного кріплення в приталеному силуеті з обємними рукавами, прилаштованими по окату. А ніжний, небесно-блакитний відтінок і круглий виріз горловини підкреслюють, наскільки це гарна сукня з жіночним підтекстом.',
               price: 1500,
               category_id: Category.find_by(title: 'Evening dress').id)

attach_photo(f)

g = Product.create(name: 'Донна',
               description: 'Одна стильна сукня, як ця модель, може кардинально зміни дівчину, зробивши образ більш спокусливим! Ніжна тканина гарно струмує, повторюючи контури тіла. Бретелі регулюються по висоті, на груді є легке драпірування. Силует модної сукні напівприталений. Кокетливий розріз збоку вигідно підкреслює стрункі ніжки. Замовляйте цю модель та інші сукні онлайн на нашому сайті!',
               price: 1400,
               category_id: Category.find_by(title: 'Summer dress').id)

attach_photo(g)

h = Product.create(name: 'Марта',
               description: 'Модну сукню з трикотажу у горизонтальну смужку оцінять любителі вільного крою! Модель-трапеція з оригінальним чорно-білим принтом. Відмінна риса сукні – широкі та короткі цільнокроєні рукави з чорною окантовкою. Довжина сукні вище колін. У бокових швах заховані зручні кишені. Обирайте стильний жіночий одяг у нас на сайті, та зустрічайте новий сезон з модними луками!',
               price: 1100,
               category_id: Category.find_by(title: 'Warm dress').id)

attach_photo(h)

i = Product.create(name: 'Конна',
               description: 'Жіноча сукня-сорочка довжиною міді – справжня знахідка для кожної дівчини! Вільний крій у вигляді трапеції зробить образ довершеним, а силует – гармонійним. Довгий вшивний рукав на манжеті добре поєднується з комірцем-стійкою та планкою попереду. Родзинка стильної сукні – косі клинця по боках, які створюю ефект повітряної тканини. Обирайте модний жіночий одяг у нас на сайті для створення гарних образів!',
               price: 1400,
               category_id: Category.find_by(title: 'Strict dress').id)

attach_photo(i)

k = Product.create(name: 'Пава',
               description: 'Якщо взяти за базу маленьку чорну сукню, яка панує в жіночих гардеробах вже декілька століть, і зробити її максимально універсальною – вийде саме така модель. Ця трикотажна сукня чорного кольору крою, який ладно облягає фігуру, здатна трансформуватись під ваш настрій. Сьогодні вона – стримано романтична, завтра – по-діловому сучасна, післязавтра – пасує до джинсової куртки та кросівок. І, звичайно, в ній є цікавинка від дизайнерів – декоративні шви з імітацією майки.',
               price: 1200,
               category_id: Category.find_by(title: 'Summer dress').id)

attach_photo(k)

User.create!(email: 'user@example.com', password: 'password', password_confirmation: 'password') unless User.where(email: 'user@example.com').present?

if Rails.env.development?
  AdminUser.create!(email: 'admin@example.com', password: 'password',
                    password_confirmation: 'password') if AdminUser.count == 0 
end
