HW11/Shop/app/controllers/application_controller.rb

  def current_cart
    if Cart.find(cookies[:cart_id]).user_id == current_user.id
      Cart.find(cookies[:cart_id])
    elsif Cart.where(user_id: current_user.id).present?
      Cart.where(user_id: current_user.id)
    else
      cart = Cart.create(user_id: current_user.id)
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2022-12-30 18:18:48.028094"], ["updated_at", "2022-12-30 18:18:48.028094"]]