HW11/Shop/app/controllers/line_items_controller.rb

  def create
    product = Product.find(params[:product_id])
    if LineItem.where(product_id: params[:product_id]).present?
      new_quantity = LineItem.find_by(product_id: params[:product_id]).quantity + 1
      LineItem.find_by(product_id: params[:product_id]).update(quantity: new_quantity)
      new_price = LineItem.find_by(product_id: params[:product_id]).price + product.price
      LineItem.find_by(product_id: params[:product_id]).update(price: new_price)
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."product_id" = $1  [["product_id", 6]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."product_id" = $1 ORDER BY "line_items"."id" ASC LIMIT $2  [["product_id", 2], ["LIMIT", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."product_id" = $1 LIMIT $2  [["product_id", 2], ["LIMIT", 1]]
UPDATE "line_items" SET "price" = $1, "updated_at" = $2 WHERE "line_items"."id" = $3  [["price", "4000.0"], ["updated_at", "2022-12-31 20:19:23.250750"], ["id", 14]]
UPDATE "line_items" SET "price" = $1, "updated_at" = $2 WHERE "line_items"."id" = $3  [["price", "2800.0"], ["updated_at", "2022-12-31 20:02:21.355462"], ["id", 13]]

  def quantity_plus
    @line_item.quantity += 1
    @line_item.price += @product_price
    @line_item.save
---
UPDATE "line_items" SET "quantity" = $1, "price" = $2, "updated_at" = $3 WHERE "line_items"."id" = $4  [["quantity", 2], ["price", "2000.0"], ["updated_at", "2023-01-01 16:20:15.450714"], ["id", 26]]

  def quantity_reduce
    if @line_item.quantity == 1
      @line_item.destroy
    else
      @line_item.quantity -= 1
      @line_item.price -= @product_price
      @line_item.save
---
DELETE FROM "line_items" WHERE "line_items"."id" = $1  [["id", 26]]
UPDATE "line_items" SET "quantity" = $1, "price" = $2, "updated_at" = $3 WHERE "line_items"."id" = $4  [["quantity", 3], ["price", "1400.0"], ["updated_at", "2023-01-01 17:01:54.652150"], ["id", 25]]

  def quantity_chenge
    @line_item = LineItem.find(params[:id])
    @product_price = Product.find(@line_item.product_id).price
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]