HW11/Shop/app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def create
    product = Product.find(params[:product_id])