HW11/Shop/app/controllers/orders_controller.rb

  def create
    @order = current_user.orders.create(cart: current_cart)
---
INSERT INTO "orders" ("status", "user_id", "cart_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["status", 0], ["user_id", 2], ["cart_id", 8], ["created_at", "2023-01-02 12:04:02.687077"], ["updated_at", "2023-01-02 12:04:02.687077"]]

  def show
    @order = current_user.orders.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 5], ["LIMIT", 1]]

  def update
    @order = Order.find(params[:id])
    @order.update(status: :paid)
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "orders" SET "status" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["status", 1], ["updated_at", "2023-01-02 13:25:51.805459"], ["id", 9]]