HW11/Shop/app/controllers/products_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @category = Category.find(@product.category_id)