HW8/stories_app/stories/app/controllers/api/v1/articles_controller.rb

  def index
    @articles = Article.all
    @articles = @articles.where("title || body LIKE ?", "%#{params[:q]}%") if params[:q]
    @articles = @articles.where(status: params[:status]) if params[:status]
    @articles = @articles.joins(:author).where("authors.name LIKE ?", "%#{params[:author]}%") if params[:author]
    @articles = @articles.joins(:tags).where("tags.name IN (?)", params[:tags].split(',')) if params[:tags]
    @articles = @articles.order(title: params[:order]) if params[:order]
---
SELECT "articles".* FROM "articles"
SELECT "articles".* FROM "articles" WHERE (body LIKE '%Ass%')
SELECT "articles".* FROM "articles" WHERE "articles"."status" = $1  [["status", 1]]
SELECT "articles".* FROM "articles" INNER JOIN "articles_tags" ON "articles_tags"."article_id" = "articles"."id" INNER JOIN "tags" ON "tags"."id" = "articles_tags"."tag_id" WHERE (tags.name ILIKE '%politics, life%')
SELECT "tags".* FROM "tags" INNER JOIN "articles_tags" ON "tags"."id" = "articles_tags"."tag_id" WHERE "articles_tags"."article_id" = $1  [["article_id", 5]]
SELECT "articles".* FROM "articles" INNER JOIN "comments" ON "comments"."article_id" = "articles"."id" WHERE (comments.status LIKE '%pablished%')
SELECT "articles".* FROM "articles" WHERE (title LIKE '%Dan%')

  def create
    @article = Article.new(article_params)
    @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "author_id", "status") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Dan_1"], ["body", "Body_Dan_1"], ["created_at", "2022-12-08 17:54:34.533732"], ["updated_at", "2022-12-08 17:54:34.533732"], ["author_id", 1], ["status", 0]]

  def update
    @article.update(article_status_update_params)
---
UPDATE "articles" SET "updated_at" = $1, "status" = $2 WHERE "articles"."id" = $3  [["updated_at", "2022-12-09 18:37:45.506429"], ["status", 1], ["id", 6]]

  def destroy
    @article.delete
---
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 4]]

  def like
    @like = Like.new(like_params)
    @like.liked = @article
    @like.save
---
INSERT INTO "likes" ("title", "liked_type", "liked_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "abc"], ["liked_type", "Article"], ["liked_id", 6], ["created_at", "2022-12-05 13:18:14.025607"], ["updated_at", "2022-12-05 13:18:14.025607"]]

  def tag_add
    @article = Article.find(params[:article_id])
    if @article.tags.include?(@tag)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT 1 AS one FROM "tags" INNER JOIN "articles_tags" ON "tags"."id" = "articles_tags"."tag_id" WHERE "articles_tags"."article_id" = $1 AND "tags"."id" = $2 LIMIT $3  [["article_id", 14], ["id", 1], ["LIMIT", 1]]