HW8/stories_app/stories/app/controllers/api/v1/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def tag_add
    @article = Article.find(params[:article_id])