HW8/stories_app/stories/app/controllers/api/v1/authors_controller.rb

  def create
    @author = Author.new(author_params)
    if @author.save
---
INSERT INTO "authors" ("created_at", "updated_at", "name") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2022-11-30 13:42:31.985545"], ["updated_at", "2022-11-30 13:42:31.985545"], ["name", "Dan"]]

  def destroy
    @author.delete
---
DELETE FROM "authors" WHERE "authors"."id" = $1  [["id", 5]]