HW11/Shop/app/views/layouts/_sidebar.html.erb

SELECT "categories".* FROM "categories"
---
  <ul class="nav nav-pills flex-column mb-auto">
      <% Category.all.each do |category| %>