HW89/stories/app/controllers/api/v1/articles_controller.rb

  def tag_add
    @article = Article.find(params[:article_id])
    if @article.tags.include?(@tag)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" INNER JOIN "articles_tags" ON "tags"."id" = "articles_tags"."tag_id" WHERE "articles_tags"."article_id" = $1  [["article_id", 1]]