HW89/stories/app/controllers/api/v1/comments_controller.rb

  def index
    @comments = Comment.all
    @comments = @comments.where(status: params[:status]) if params[:status]
---
SELECT "comments".* FROM "comments"
SELECT "comments".* FROM "comments" WHERE "comments"."status" = $1  [["status", 1]]

  def create
    @comment = Comment.new(comment_params)
    if @comment.save
---
INSERT INTO "comments" ("created_at", "updated_at", "body", "status", "article_id", "author_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2022-12-08 20:42:40.296859"], ["updated_at", "2022-12-08 20:42:40.296859"], ["body", "New comment000"], ["status", 1], ["article_id", 6], ["author_id", 2]]

  def update
    @comment.update(comment_params)#(comment_update_status_params)
---
UPDATE "comments" SET "updated_at" = $1, "status" = $2 WHERE "comments"."id" = $3  [["updated_at", "2022-12-01 01:47:01.515488"], ["status", 0], ["id", 1]]

  def destroy
    @comment.delete
---
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 14]]

  def like
    @like = Like.new(like_params)
    @like.liked = @comment
    @like.save
---
INSERT INTO "likes" ("title", "liked_type", "liked_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "smil"], ["liked_type", "Comment"], ["liked_id", 1], ["created_at", "2022-12-05 18:34:01.067179"], ["updated_at", "2022-12-05 18:34:01.067179"]]