HW89/stories/app/controllers/api/v1/likes_controller.rb

  def create
    @like = Like.new(like_params)
    @like.likeable = @like.likeable_type.constantize.find(@like.likeable_id)
    if @like.save
---
INSERT INTO "likes" ("likeable_type", "likeable_id", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["likeable_type", "Article"], ["likeable_id", 2], ["created_at", "2022-12-18 21:21:47.983154"], ["updated_at", "2022-12-18 21:21:47.983154"], ["author_id", 11]]