HW11/Shop/app/views/orders/show.html.erb

          <td>Total price :</td>
          <td><%= @order.cart.line_items.map(&:price).sum %><%= button_to "PAY", order_path, method: :patch, class: 'btn btn-primary' %></td>
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 9]]