HW11/Shop/app/models/cart.rb

  def add_product(product)
    line_items.create(product: product, quantity: 1, price: product.price)
---
INSERT INTO "line_items" ("quantity", "price", "cart_id", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["quantity", 1], ["price", "1400.0"], ["cart_id", 9], ["product_id", 2], ["created_at", "2023-01-02 12:36:16.155308"], ["updated_at", "2023-01-02 12:36:16.155308"]]