HW7/stories_app/stories/app/controllers/api/v1/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "author_id", "status") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Title_1"], ["body", "Body_1"], ["created_at", "2022-12-05 13:09:06.891470"], ["updated_at", "2022-12-05 13:09:06.891470"], ["author_id", 2], ["status", 0]]

  def update
    @article.update(article_status_update_params)
---
UPDATE "articles" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "articles"."id" = $4  [["title", "444"], ["body", "44444"], ["updated_at", "2022-11-27 16:38:51.306711"], ["id", 4]]

  def destroy
    @article.delete
---
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 4]]

  def like
    @like = Like.new(like_params)
    @like.liked = @article
    @like.save
---
INSERT INTO "likes" ("title", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "10"], ["likeable_type", "Article"], ["likeable_id", 10], ["created_at", "2022-12-13 20:47:40.805166"], ["updated_at", "2022-12-13 20:47:40.805166"]]

  def tag_add
    @article = Article.find(params[:article_id])
    if @article.tags.include?(@tag)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT 1 AS one FROM "tags" INNER JOIN "articles_tags" ON "tags"."id" = "articles_tags"."tag_id" WHERE "articles_tags"."article_id" = $1 AND "tags"."id" = $2 LIMIT $3  [["article_id", 5], ["id", 1], ["LIMIT", 1]]