HW7/stories_app/stories/app/controllers/api/v1/comments_controller.rb

  def index
    @comments = Comment.all
    @comments = @comments.where(status: params[:status]) if params[:status]
---
SELECT "comments".* FROM "comments"
SELECT "comments".* FROM "comments" WHERE "comments"."status" = $1  [["status", 1]]

  def create
    @comment = Comment.new(comment_params)
    @comment.save
---
INSERT INTO "comments" ("created_at", "updated_at", "body", "status", "article_id", "author_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2022-12-01 01:45:37.471560"], ["updated_at", "2022-12-01 01:45:37.471560"], ["body", "New comment000"], ["status", 0], ["article_id", 5], ["author_id", 2]]

  def update
    @comment.update(comment_update_status_params)
---
UPDATE "comments" SET "updated_at" = $1, "status" = $2 WHERE "comments"."id" = $3  [["updated_at", "2022-12-01 01:47:01.515488"], ["status", 0], ["id", 1]]

  def like
    @like = Like.new(like_params)
    @like.liked = @comment
    @like.save
---
INSERT INTO "likes" ("title", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "smil"], ["likeable_type", "Comment"], ["likeable_id", 5], ["created_at", "2022-12-13 20:45:45.019931"], ["updated_at", "2022-12-13 20:45:45.019931"]]