HW7/stories_app/stories/app/controllers/api/v1/likes_controller.rb

INSERT INTO "likes" ("title", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Abc"], ["likeable_type", "Article"], ["likeable_id", 14], ["created_at", "2022-12-14 06:04:09.971672"], ["updated_at", "2022-12-14 06:04:09.971672"]]
---
  def like
    @like = Like.new(like_params)
    @like.save