HW7/stories_app/stories/app/controllers/api/v1/tags_controller.rb

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "geekhub"], ["created_at", "2022-12-04 16:17:47.162111"], ["updated_at", "2022-12-04 16:17:47.162111"]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def create
    @tag = Tag.new(tag_params)
    @tag.save
    Article.find(params[:ar]).tags << @tag if params[:ar]

SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def show
    Article.find(params[:ar]).tags << @tag if params[:ar]