HW5-6/stories/app/controllers/api/v1/articles_controller.rb

      def create
        @article = Article.new(params_article) # (title: params[:title], body: params[:body])
        @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Title_1"], ["body", "Body_1"], ["created_at", "2022-11-29 20:08:39.307497"], ["updated_at", "2022-11-29 20:08:39.307497"], ["author_id", 2]]

      def update
        @article.update(params_article) # (body: params[:body])
---
UPDATE "articles" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "articles"."id" = $4  [["title", "5-5-5-5-5"], ["body", "5-5-5-5-5-5"], ["updated_at", "2022-11-20 16:42:29.577621"], ["id", 6]]

      def destroy
        @article.delete
---
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 4]]