HW5-6/stories/app/controllers/api/v1/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."status" IN ($1, $2)  [["status", 0], ["status", 1]]
---
      def index
        @comments = Comment.where(status: params[:status] || :unpublished)

INSERT INTO "comments" ("body", "status", "author_id", "created_at", "updated_at", "article_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "New comment"], ["status", 0], ["author_id", 1], ["created_at", "2022-11-29 18:56:15.859363"], ["updated_at", "2022-11-29 18:56:15.859363"], ["article_id", 1]]
---
      def create
        @comment = Comment.new(comment_create_params)
        @comment.save

UPDATE "comments" SET "body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["body", "000000"], ["updated_at", "2022-11-27 13:37:43.357837"], ["id", 1]]
---
      def update
        @comment.update(comment_params)