HW5-6/stories/app/controllers/api/v1/comments_controller.rb

UPDATE "comments" SET "body" = $1, "status" = $2, "updated_at" = $3 WHERE "comments"."id" = $4  [["body", "Body firs comment"], ["status", 1], ["updated_at", "2022-11-26 16:51:28.035461"], ["id", 1]]
---
      def update
        @comment.update(comment_params)