# frozen_string_literal: true

def attach_photo(product)
  file_name = product.id.to_s.chars.last
  file_name = '10' if file_name == '0'
  product.photo.attach(io: File.open("app/assets/images/#{file_name}.jpg"), filename: "#{file_name}.jpg")
  product.save
end

# array_title = ['Evening dress', 'Casual dress', 'Strict dress','Warm dress', 'Summer dress']

# array_title.each do |title|
#   Category.find_or_create_by(title: title)
# end

category_one = Category.find_or_create_by(title: 'Evening dress')
category_two = Category.find_or_create_by(title: 'Casual dress')
category_three = Category.find_or_create_by(title: 'Strict dress')
category_four = Category.find_or_create_by(title: 'Warm dress')
category_five = Category.find_or_create_by(title: 'Summer dress')

# category_one = Category.find_or_create_by(title: 'aaa')

# byebug


product_one = Product.create(name: 'Веселка',
               description: 'Правильно обрана сукня жіноча підіймає настрій на цілий день!
               Модель зшита з крепу має квітковий принт. Сукня має круглий виріз горловини, довгі рукави та довжину міді.Силует напівприталений, злегка розширений. Талію підкреслює знімний пасок. Ви завжди можете купити сукню через інтернет у нас на сайті з доставленням по Україні.',
               price: 1200,
               category_id: category_one.id)

attach_photo(product_one)

product_two = Product.create(name: 'Ко-ко',
               description: 'Елегантна сукня глибокого сірого кольору – чудове рішення для робочих буднів! В міру щільна та фактурна тканина вигідно виглядає з мінімум деталями. Сукня вище колін, з довгими вшивними рукавами. Шию та зону декольте гарно обрамлює V-подібний виріз горловини. Силует прямий, у бокових швах заховані невеликі кишені. Ця сукня жіноча завжди виручить у прохолодні дні!',
               price: 1400,
               category_id: category_four.id)

attach_photo(product_two)

product_three = Product.create(name: 'Агата',
               description: 'Придивіться до цієї жіночої трикотажної сукні та уявіть її у своєму гардеробі. Впевнені майже на 100%, що у вас є речі та аксесуари, які до неї пасуватимуть. Річ в тім, що саме такий крій стильної сукні до коліна для жінок є найуніверсальнішим – вона може бути константою образу або його вагомою частиною: зі шкірянкою та кросівками, із черевичками на підборах і кардиганом, із масивними чи елегантними чоботами тощо.',
               price: 1000,
               category_id: category_three.id)

attach_photo(product_three)

product_four = Product.create(name: 'Роза',
               description: 'Полюбляючи зручні речі й не надаючи перевагу естетиці без комфорту, сучасні жінки радо наповнюють гардероб саме такими сукнями, як ця! Неймовірно жіночна, зі зручною довжиною до коліна та з елегантною горловиною-човником, яка трішки відкриває ключиці, вона не сковує рухів і в одну мить стає стильною частиною повсякденного образу. Бежевий колір з тендітним принтом прикрашений вставками з екошкіри по плечах. Довгий спущений рукав і пояс, який за потреби можна одягати, а можна й залишити вдома.',
               price: 1500,
               category_id: category_two.id)

attach_photo(product_four)

product_five = Product.create(name: 'Краса',
               description: 'Полюбляючи зручні речі й не надаючи перевагу естетиці без комфорту, сучасні жінки радо наповнюють гардероб саме такими сукнями, як ця! Неймовірно жіночна, зі зручною довжиною до коліна та з елегантною горловиною-човником, яка трішки відкриває ключиці, вона не сковує рухів і в одну мить стає стильною частиною повсякденного образу. Бежевий колір з тендітним принтом прикрашений вставками з екошкіри по плечах. Довгий спущений рукав і пояс, який за потреби можна одягати, а можна й залишити вдома.',
               price: 1500,
               category_id: category_two.id))

attach_photo(product_five)

product_six = Product.create(name: 'Отава',
               description: 'Мода – циклічна, і ця стильна сукня з інтернет-магазину якнайкраще демонструє торжество крою з 80-х! Модель, представлена на сайті жіночого одягу, пошита з костюмного кріплення в приталеному силуеті з обємними рукавами, прилаштованими по окату. А ніжний, небесно-блакитний відтінок і круглий виріз горловини підкреслюють, наскільки це гарна сукня з жіночним підтекстом.',
               price: 1500,
               category_id: category_one.id)

attach_photo(product_six)

product_seven = Product.create(name: 'Донна',
               description: 'Одна стильна сукня, як ця модель, може кардинально зміни дівчину, зробивши образ більш спокусливим! Ніжна тканина гарно струмує, повторюючи контури тіла. Бретелі регулюються по висоті, на груді є легке драпірування. Силует модної сукні напівприталений. Кокетливий розріз збоку вигідно підкреслює стрункі ніжки. Замовляйте цю модель та інші сукні онлайн на нашому сайті!',
               price: 1400,
               category_id: category_five.id)

attach_photo(product_seven)

product_eight = Product.create(name: 'Марта',
               description: 'Модну сукню з трикотажу у горизонтальну смужку оцінять любителі вільного крою! Модель-трапеція з оригінальним чорно-білим принтом. Відмінна риса сукні – широкі та короткі цільнокроєні рукави з чорною окантовкою. Довжина сукні вище колін. У бокових швах заховані зручні кишені. Обирайте стильний жіночий одяг у нас на сайті, та зустрічайте новий сезон з модними луками!',
               price: 1100,
               category_id: category_four.id)

attach_photo(product_eight)

product_nine = Product.create(name: 'Конна',
               description: 'Жіноча сукня-сорочка довжиною міді – справжня знахідка для кожної дівчини! Вільний крій у вигляді трапеції зробить образ довершеним, а силует – гармонійним. Довгий вшивний рукав на манжеті добре поєднується з комірцем-стійкою та планкою попереду. Родзинка стильної сукні – косі клинця по боках, які створюю ефект повітряної тканини. Обирайте модний жіночий одяг у нас на сайті для створення гарних образів!',
               price: 1400,
               category_id: category_three.id)

attach_photo(product_nine)

product_ten = Product.create(name: 'Пава',
               description: 'Якщо взяти за базу маленьку чорну сукню, яка панує в жіночих гардеробах вже декілька століть, і зробити її максимально універсальною – вийде саме така модель. Ця трикотажна сукня чорного кольору крою, який ладно облягає фігуру, здатна трансформуватись під ваш настрій. Сьогодні вона – стримано романтична, завтра – по-діловому сучасна, післязавтра – пасує до джинсової куртки та кросівок. І, звичайно, в ній є цікавинка від дизайнерів – декоративні шви з імітацією майки.',
               price: 1200,
               category_id: category_five.id)

attach_photo(product_ten)

User.find_or_create_by(email: 'user@example.com', password: 'password', password_confirmation: 'password')

if Rails.env.development? && AdminUser.count.zero?
  AdminUser.create(email: 'admin@example.com', password: 'password',
                    password_confirmation: 'password')
end
