HW5/stories/app/controllers/api/v1/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Two"], ["body", "Body two"], ["created_at", "2022-11-16 21:38:24.034962"], ["updated_at", "2022-11-16 21:38:24.034962"]]
---
  def create
    @article = Article.new(title: params[:title], body: params[:body])
    @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "body" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["body", "Body two"], ["updated_at", "2022-11-16 21:57:11.948186"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])
    @article.update(body: params[:body])

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 4]]
---
  def destroy
    @article = Article.find(params[:id])
    @article.delete